## 数据库加载

In [1]:
%load_ext sql

In [3]:
import pymysql 
pymysql.install_as_MySQLdb()
%sql mysql://stu2000013727:stu2000013727@162.105.146.37:43306

In [3]:
%sql use stu2000013727;

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]

## 查看所有表

In [5]:
%sql show tables

 * mysql://stu2000013727:***@162.105.146.37:43306
7 rows affected.

[('account',),
 ('bill',),
 ('diary',),
 ('friend',),
 ('message',),
 ('qq_user',),
 ('todolist',)]

In [4]:
%sql select* from account

 * mysql://stu2000013727:***@162.105.146.37:43306
5 rows affected.

[(6, None, 'test2333', '384e26fa06995a2b0af99e901b539b410bf538b651077b7494e95522072ba742'),
 (7, None, '11111111', 'ee79976c9380d5e337fc1c095ece8c8f22f91f306ceeb161fa51fecede2c4ba1'),
 (8, None, '22222222', '33a7d3da476a32ac237b3f603a1be62fad00299e0d4b5a8db8d913104edec629'),
 (9, None, '33333333', 'afb47e00531153e93808589e43d02c11f6398c5bc877f7924cebca8211c8dd18'),
 (10, None, 'abcd', 'ee79976c9380d5e337fc1c095ece8c8f22f91f306ceeb161fa51fecede2c4ba1')]

In [5]:
%sql select * from bill

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]

In [6]:
%sql select * from diary

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]

In [11]:
%sql select * from friend

 * mysql://stu2000013727:***@162.105.146.37:43306
1 rows affected.

[(6, None, 6, '')]

In [8]:
%sql select * from message

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]

In [9]:
%sql select * from qq_user

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]

In [10]:
%sql select * from todolist

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]